Revit 2027 API
BuiltInFailures.StructuralLoadFailures.HostChangeDisallowsLoadOrBoundaryConditions Property
 Some Hosted Loads or BoundaryConditions lost their References. They will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostChangeDisallowsLoadOrBoundaryConditions { get; }
Public Shared ReadOnly Property HostChangeDisallowsLoadOrBoundaryConditions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostChangeDisallowsLoadOrBoundaryConditions {
	FailureDefinitionId^ get ();
}
static member HostChangeDisallowsLoadOrBoundaryConditions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralLoadFailures Class
Autodesk.Revit.DB Namespace